package com.zfc.daytest;/**
 * @version: 0.1.0
 * @author: Zhangfucai
 * @Description:
 * @create: 2021-04-02 07:57
 * @Modified By:
 */

/**
 * @ClassName: day02
 * @Description 每日一考
 * 1.标识符的命名规则有哪些？（必须要遵守，否则编译不通过）
 * 对各种变量、方法和类等要素命名时使用的字符序列称为标识符。
 * 由26个英文字母大小写，0-9，_或$组成；
 * 数字不可以开头；
 * 不可以使用关键字和保留字，但能包含关键字和保留字；
 * 严格区分大小写，长度无限制；
 * 标识符不能包含空格。
 *
 * 2.标识符的命名规范有哪些？（可以不遵守，不影响编译和运行，但是最好遵守）
 * 包名：xxxyyyzzz
 * 类名、接口名：XxxYyyZzz
 * 变量名、方法名：xxxYyyZzz
 * 变量名： XXX_YYY_ZZZ
 *
 * 3.Java变量按照数据类型怎么划分？并指出Java的基本数据类型有哪8种，并指出各自占用的内存空间大小。
 * 基本数据类型、引用数据类型
 * byte:字节，占8位（1字节）。
 * short：短整型，占16位（2字节）。
 * int：整型，占32位（4字节）。
 * long：长整型，占64位（8字节）。
 * float：浮点型，占32位（4字节）。
 * double：双精度浮点型，占64位（8字节）。
 * char：字符型，占16位（2字节）。
 * boolean: 布尔型，占32位（4字节），底层为int。
 *
 * 引用数据类型：类、接口、数组。
 * class,interface,array
 *
 * 4.说明基本数据类型变量之间自动类型提升的运算规则。
 * 当数据类型容量小与容量大的数据类型做运算时，结果自动提升为容量大的数据类型。
 * byte,short,char --> int --> long --> float --> double
 *
 * 5.说明基本数据类型变量之间强制类型转换的使用规则和强转可能出现的问题。
 * 低的可以直接转到高的，高的转到低的时会损失精度。
 *
 *
 * @Author: Zhangfucai
 * @Date: 2021/4/2 7:57
 * @Version: 1.0
 */
public class day02 {
}
